ilogicsBoss/Board/CustomBoard/Hardware/ILOGICS/avr/variants/MPAINO_2560/pins_arduino.h
// =============================================================
// Serial 포트 별칭 — 라이브러리/스케치가 보드 종류와 무관하게
// 적절한 포트로 자동 매핑되도록 하는 표준 매크로들.
//   SERIAL_PORT_MONITOR       : Serial Monitor 출력용
//   SERIAL_PORT_HARDWARE      : 하드웨어 시리얼 (RX/TX 물리핀)
//   SERIAL_PORT_HARDWARE_OPEN : 다른 용도가 없는 빈 하드웨어 시리얼
// =============================================================
// (원문 주석)
// These serial port names are intended to allow libraries and architecture-neutral
// sketches to automatically default to the correct port name for a particular type
// of use.  For example, a GPS module would normally connect to SERIAL_PORT_HARDWARE_OPEN,
// the first hardware serial port whose RX/TX pins are not dedicated to another use.
//
// SERIAL_PORT_MONITOR        Port which normally prints to the Arduino Serial Monitor
//
// SERIAL_PORT_USBVIRTUAL     Port which is USB virtual serial
//
// SERIAL_PORT_LINUXBRIDGE    Port which connects to a Linux system via Bridge library
//
// SERIAL_PORT_HARDWARE       Hardware serial port, physical RX & TX pins.
//
// SERIAL_PORT_HARDWARE_OPEN  Hardware serial ports which are open for use.  Their RX & TX
//                            pins are NOT connected to anything by default.
#define SERIAL_PORT_MONITOR         Serial
#define SERIAL_PORT_HARDWARE        Serial
#define SERIAL_PORT_HARDWARE1       Serial1
#define SERIAL_PORT_HARDWARE2       Serial2
#define SERIAL_PORT_HARDWARE3       Serial3
#define SERIAL_PORT_HARDWARE_OPEN   Serial1
#define SERIAL_PORT_HARDWARE_OPEN1  Serial2
#define SERIAL_PORT_HARDWARE_OPEN2  Serial3

#endif
